openfoam/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v13
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//
// Extended underground mine geometry — all dimensions in metres.
//
// Geometry overview (plan view, z = 0..3 m height, not shown):
//
//  Y
//  ^
//  20 |  [Chamber 2]  x=[50,62], y=[4,20]  (12m wide x 16m deep)
//     |  +-----------+
//  4  |  |     |     |             second dead-end (offset, N side)
//     +--+--+--+--+--+-----------+-----------+-----------+--> X
//        |  |  |  |  |           |           |           |
//  0  |  A  B  C  D  E           F           G           |
//        |  |     |              |                       80
//  -6 |  |  |  [S.Stub]         |  [Chamber 1] x=[20,30], y=[4,16]
//     |  |  |  x=[35,43]        |  (10m wide x 12m deep, N side)
//        0  20                  50
//
// Detailed plan (correct layout):
//
//                     Cham1          Cham2
//                  x=[20,30]      x=[50,62]
//                  y=[4,16]       y=[4,20]
//                 +---------+    +----------+
//                 |    N    |    |    N     |
//  IN --> [A] --[B]--[C]--[D]--[E]---[F]---[G] --> OUT
//   x=0        20  30  35  43  50    62    80
//                        |   |
//                     [SouthStub]
//                     x=[35,43]
//                     y=[-6,0]
//
// Blocks:
//   A: main tunnel x=[0,20]   — inlet section
//   B: main tunnel x=[20,30]  — junction 1 (Chamber 1 opens north)
//   C: main tunnel x=[30,35]  — inter-junction section
//   D: main tunnel x=[35,43]  — junction 2 (South Stub opens south)
//   E: main tunnel x=[43,50]  — inter-junction section
//   F: main tunnel x=[50,62]  — junction 3 (Chamber 2 opens north)
//   G: main tunnel x=[62,80]  — outlet section
//   Chamber 1: x=[20,30], y=[4,16]   (north dead-end, 10m x 12m)
//   Chamber 2: x=[50,62], y=[4,20]   (north dead-end, 12m x 16m, offset)
//   South Stub: x=[35,43], y=[-6,0]  (south recess, 8m x 6m)
//
// Total cells: ~31,600  (~0.4-0.5 m resolution)
// Sufficient for serial OpenFOAM run at 300 s mine-time.
//
// Vertex index conventions:
//   Bottom plane (z=0): vertices 0-21
//   Top plane    (z=3): vertices 22-43
//   Vertices 0-7  / 22-29: y=0 row (south tunnel wall)
//   Vertices 8-15 / 30-37: y=4 row (north tunnel wall / chamber south face)
//   Vertices 16-17 / 38-39: y=16 row (Chamber 1 dead end)
//   Vertices 18-19 / 40-41: y=20 row (Chamber 2 dead end)
//   Vertices 20-21 / 42-43: y=-6 row (South Stub dead end)
//
// Face connectivity (interior — not listed in boundary):
//   Block B y_max  <-> Chamber 1 y_min  (vertices {9,10,31,32})
//   Block D y_min  <-> South Stub y_max (vertices {3,4,25,26})
//   Block F y_max  <-> Chamber 2 y_min  (vertices {13,14,35,36})
//
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    // ===== BOTTOM PLANE (z=0) =====

    // y=0 row — south tunnel wall, z=0
    (  0   0   0)   //  v0   inlet face corner
    ( 20   0   0)   //  v1   junction 1 west (Chamber 1 x-start)
    ( 30   0   0)   //  v2   junction 1 east (Chamber 1 x-end)
    ( 35   0   0)   //  v3   junction 2 west (South Stub x-start)
    ( 43   0   0)   //  v4   junction 2 east (South Stub x-end)
    ( 50   0   0)   //  v5   junction 3 west (Chamber 2 x-start)
    ( 62   0   0)   //  v6   junction 3 east (Chamber 2 x-end)
    ( 80   0   0)   //  v7   outlet face corner

    // y=4 row — north tunnel wall / south face of north chambers, z=0
    (  0   4   0)   //  v8
    ( 20   4   0)   //  v9   Chamber 1 SW corner
    ( 30   4   0)   //  v10  Chamber 1 SE corner
    ( 35   4   0)   //  v11
    ( 43   4   0)   //  v12
    ( 50   4   0)   //  v13  Chamber 2 SW corner
    ( 62   4   0)   //  v14  Chamber 2 SE corner
    ( 80   4   0)   //  v15

    // y=16 row — Chamber 1 dead-end wall, z=0
    ( 20  16   0)   //  v16  Chamber 1 NW corner
    ( 30  16   0)   //  v17  Chamber 1 NE corner

    // y=20 row — Chamber 2 dead-end wall, z=0
    ( 50  20   0)   //  v18  Chamber 2 NW corner
    ( 62  20   0)   //  v19  Chamber 2 NE corner

    // y=-6 row — South Stub dead-end wall, z=0
    ( 35  -6   0)   //  v20  South Stub SW corner
    ( 43  -6   0)   //  v21  South Stub SE corner

    // ===== TOP PLANE (z=3) =====

    // y=0 row — south tunnel ceiling, z=3
    (  0   0   3)   //  v22
    ( 20   0   3)   //  v23
    ( 30   0   3)   //  v24
    ( 35   0   3)   //  v25
    ( 43   0   3)   //  v26
    ( 50   0   3)   //  v27
    ( 62   0   3)   //  v28
    ( 80   0   3)   //  v29

    // y=4 row — north tunnel ceiling / chamber south ceiling, z=3
    (  0   4   3)   //  v30
    ( 20   4   3)   //  v31  Chamber 1 SW corner (top)
    ( 30   4   3)   //  v32  Chamber 1 SE corner (top)
    ( 35   4   3)   //  v33
    ( 43   4   3)   //  v34
    ( 50   4   3)   //  v35  Chamber 2 SW corner (top)
    ( 62   4   3)   //  v36  Chamber 2 SE corner (top)
    ( 80   4   3)   //  v37

    // y=16 row — Chamber 1 dead-end ceiling, z=3
    ( 20  16   3)   //  v38  Chamber 1 NW corner (top)
    ( 30  16   3)   //  v39  Chamber 1 NE corner (top)

    // y=20 row — Chamber 2 dead-end ceiling, z=3
    ( 50  20   3)   //  v40  Chamber 2 NW corner (top)
    ( 62  20   3)   //  v41  Chamber 2 NE corner (top)

    // y=-6 row — South Stub dead-end ceiling, z=3
    ( 35  -6   3)   //  v42  South Stub SW corner (top)
    ( 43  -6   3)   //  v43  South Stub SE corner (top)
);

// ---------------------------------------------------------------------------
// BLOCKS
// Standard hex vertex ordering: (x_min_y_min_z_min, x_max_y_min_z_min,
//                                 x_max_y_max_z_min, x_min_y_max_z_min,
//                                 x_min_y_min_z_max, x_max_y_min_z_max,
//                                 x_max_y_max_z_max, x_min_y_max_z_max)
// Cell counts chosen for ~0.4-0.5 m resolution throughout.
// Total: 4000+2000+1000+1600+1400+2400+3600+6000+7680+1920 = ~31,600 cells
// ---------------------------------------------------------------------------

blocks
(
    // Block A: main tunnel inlet section, x=[0,20], y=[0,4], z=[0,3]
    // 40 x 10 x 10 = 4,000 cells  (0.50m x 0.40m x 0.30m)
    hex ( 0  1  9  8  22  23  31  30)   (40 10 10)  simpleGrading (1 1 1)

    // Block B: junction 1 — Chamber 1 opens north, x=[20,30], y=[0,4], z=[0,3]
    // y_max face is INTERIOR (shared with Chamber 1 y_min face)
    // 20 x 10 x 10 = 2,000 cells
    hex ( 1  2  10  9  23  24  32  31)  (20 10 10)  simpleGrading (1 1 1)

    // Block C: inter-junction section, x=[30,35], y=[0,4], z=[0,3]
    // 10 x 10 x 10 = 1,000 cells
    hex ( 2  3  11  10  24  25  33  32) (10 10 10)  simpleGrading (1 1 1)

    // Block D: junction 2 — South Stub opens south, x=[35,43], y=[0,4], z=[0,3]
    // y_min face is INTERIOR (shared with South Stub y_max face)
    // 16 x 10 x 10 = 1,600 cells
    hex ( 3  4  12  11  25  26  34  33) (16 10 10)  simpleGrading (1 1 1)

    // Block E: inter-junction section, x=[43,50], y=[0,4], z=[0,3]
    // 14 x 10 x 10 = 1,400 cells
    hex ( 4  5  13  12  26  27  35  34) (14 10 10)  simpleGrading (1 1 1)

    // Block F: junction 3 — Chamber 2 opens north, x=[50,62], y=[0,4], z=[0,3]
    // y_max face is INTERIOR (shared with Chamber 2 y_min face)
    // 24 x 10 x 10 = 2,400 cells
    hex ( 5  6  14  13  27  28  36  35) (24 10 10)  simpleGrading (1 1 1)

    // Block G: main tunnel outlet section, x=[62,80], y=[0,4], z=[0,3]
    // 36 x 10 x 10 = 3,600 cells
    hex ( 6  7  15  14  28  29  37  36) (36 10 10)  simpleGrading (1 1 1)

    // Chamber 1: north dead-end, x=[20,30], y=[4,16], z=[0,3]
    // y_min face is INTERIOR (shared with Block B y_max face)
    // 20 x 30 x 10 = 6,000 cells  (0.50m x 0.40m x 0.30m)
    hex ( 9  10  17  16  31  32  39  38) (20 30 10)  simpleGrading (1 1 1)

    // Chamber 2: north dead-end (offset), x=[50,62], y=[4,20], z=[0,3]
    // y_min face is INTERIOR (shared with Block F y_max face)
    // 24 x 32 x 10 = 7,680 cells  (0.50m x 0.50m x 0.30m)
    hex (13  14  19  18  35  36  41  40) (24 32 10)  simpleGrading (1 1 1)

    // South Stub: south recess, x=[35,43], y=[-6,0], z=[0,3]
    // y_max face is INTERIOR (shared with Block D y_min face)
    // 16 x 12 x 10 = 1,920 cells  (0.50m x 0.50m x 0.30m)
    hex (20  21   4   3  42  43  26  25) (16 12 10)  simpleGrading (1 1 1)
);

edges ();

// ---------------------------------------------------------------------------
// BOUNDARY PATCHES
// Face vertex ordering follows right-hand rule for outward normal.
// Interior faces (block-block connections) are NOT listed here.
// ---------------------------------------------------------------------------

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0  22  30  8)    // Block A x_min face (x=0)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (7  15  37  29)   // Block G x_max face (x=80)
        );
    }

    walls
    {
        type wall;
        faces
        (
            // ---- Block A: x=[0,20], y=[0,4] ----
            ( 0   1  23  22)  // south wall y=0
            ( 8  30  31   9)  // north wall y=4, x=[0,20]
            ( 0   8   9   1)  // floor z=0
            (22  23  31  30)  // ceiling z=3

            // ---- Block B: x=[20,30], y=[0,4] ----
            // y_max is interior → omitted
            ( 1   2  24  23)  // south wall y=0
            ( 1   9  10   2)  // floor z=0
            (23  24  32  31)  // ceiling z=3

            // ---- Block C: x=[30,35], y=[0,4] ----
            ( 2   3  25  24)  // south wall y=0
            (10  32  33  11)  // north wall y=4, x=[30,35]
            ( 2  10  11   3)  // floor z=0
            (24  25  33  32)  // ceiling z=3

            // ---- Block D: x=[35,43], y=[0,4] ----
            // y_min is interior → omitted
            (11  33  34  12)  // north wall y=4, x=[35,43]
            ( 3  11  12   4)  // floor z=0
            (25  26  34  33)  // ceiling z=3

            // ---- Block E: x=[43,50], y=[0,4] ----
            ( 4   5  27  26)  // south wall y=0
            (12  34  35  13)  // north wall y=4, x=[43,50]
            ( 4  12  13   5)  // floor z=0
            (26  27  35  34)  // ceiling z=3

            // ---- Block F: x=[50,62], y=[0,4] ----
            // y_max is interior → omitted
            ( 5   6  28  27)  // south wall y=0
            ( 5  13  14   6)  // floor z=0
            (27  28  36  35)  // ceiling z=3

            // ---- Block G: x=[62,80], y=[0,4] ----
            ( 6   7  29  28)  // south wall y=0
            (14  36  37  15)  // north wall y=4, x=[62,80]
            ( 6  14  15   7)  // floor z=0
            (28  29  37  36)  // ceiling z=3

            // ---- Chamber 1: x=[20,30], y=[4,16] ----
            // y_min is interior → omitted
            ( 9  31  38  16)  // west wall x=20
            (10  17  39  32)  // east wall x=30
            (16  38  39  17)  // dead-end wall y=16
            ( 9  16  17  10)  // floor z=0
            (31  32  39  38)  // ceiling z=3

            // ---- Chamber 2: x=[50,62], y=[4,20] ----
            // y_min is interior → omitted
            (13  35  40  18)  // west wall x=50
            (14  19  41  36)  // east wall x=62
            (18  40  41  19)  // dead-end wall y=20
            (13  18  19  14)  // floor z=0
            (35  36  41  40)  // ceiling z=3

            // ---- South Stub: x=[35,43], y=[-6,0] ----
            // y_max is interior → omitted
            (20  21  43  42)  // dead-end wall y=-6
            (20  42  25   3)  // west wall x=35
            (21   4  26  43)  // east wall x=43
            (20   3   4  21)  // floor z=0
            (42  43  26  25)  // ceiling z=3
        );
    }
);

mergePatchPairs ();

// ************************************************************************* //
