openfoam/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
31600
(
(0.25 0.2 0.15)
(0.75 0.2 0.15)
(1.25 0.2 0.15)
(1.75 0.2 0.15)
(2.25 0.2 0.15)
(2.75 0.2 0.15)
(3.25 0.2 0.15)
(3.75 0.2 0.15)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
100
(
(0 0.2 0.15)
(0 0.6 0.15)
(0 1 0.15)
(0 1.4 0.15)
(0 1.8 0.15)
(0 2.2 0.15)
(0 2.6 0.15)
(0 3 0.15)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
100
(
(80 0.2 0.15)
(80 0.6 0.15)
(80 1 0.15)
(80 1.4 0.15)
(80 1.8 0.15)
(80 2.2 0.15)
(80 2.6 0.15)
(80 3 0.15)
...
)
;
    }
    walls
    {
        type            calculated;
        value           nonuniform List<vector> 
11000
(
(0.25 0 0.15)
(0.25 0 0.45)
(0.25 0 0.75)
(0.25 0 1.05)
(0.25 0 1.35)
(0.25 0 1.65)
(0.25 0 1.95)
(0.25 0 2.25)
...
)
;
    }
}


// ************************************************************************* //
