openfoam/0/Ccx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ccx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
31600
(
0.25
0.75
1.25
1.75
2.25
2.75
3.25
3.75
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
80
80
80
80
80
80
80
80
...
)
;
    }
    walls
    {
        type            calculated;
        value           nonuniform List<scalar> 
11000
(
0.25
0.25
0.25
0.25
0.25
0.25
0.25
0.25
...
)
;
    }
}


// ************************************************************************* //
