openfoam/0/Ccy
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ccy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
31600
(
0.2
0.2
0.2
0.2
0.2
0.2
0.2
0.2
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
0.2
0.6
1
1.4
1.8
2.2
2.6
3
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
0.2
0.6
1
1.4
1.8
2.2
2.6
3
...
)
;
    }
    walls
    {
        type            calculated;
        value           nonuniform List<scalar> 
11000
(
0
0
0
0
0
0
0
0
...
)
;
    }
}


// ************************************************************************* //
