openfoam/0/Ccz
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ccz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
31600
(
0.15
0.15
0.15
0.15
0.15
0.15
0.15
0.15
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
0.15
0.15
0.15
0.15
0.15
0.15
0.15
0.15
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
0.15
0.15
0.15
0.15
0.15
0.15
0.15
0.15
...
)
;
    }
    walls
    {
        type            calculated;
        value           nonuniform List<scalar> 
11000
(
0.15
0.45
0.75
1.05
1.35
1.65
1.95
2.25
...
)
;
    }
}


// ************************************************************************* //
