openfoam/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v8
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// Turbulent kinetic energy
// Inlet: U=2 m/s, I=5%  -> k = 1.5*(U*I)^2 = 0.015 m2/s2
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.015;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.015;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.015;
        value           uniform 0.015;
    }

    walls
    {
        type            kqRWallFunction;
        value           uniform 0.015;
    }
}

// ************************************************************************* //
