openfoam/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    walls
    {
        type            calculated;
        value           nonuniform List<vector> 
11000
(
(-0.00026895648 0 0)
(-0.00026895648 0 0)
(-0.00026895648 0 0)
(-0.00026895648 -8.294491e-21 0)
(-0.00026895648 0 0)
(-0.00026895648 0 0)
(-0.00026895648 0 0)
(-0.00026895648 0 0)
...
)
;
    }
}


// ************************************************************************* //
