openfoam/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v13
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//
// v13 migration additions (compressible fluid solver):
//   div(phi,h)    — enthalpy advection (fluid solver solves h, not T directly)
//   div(phi,K)    — kinetic energy transport
//   div(phid,p)   — density-weighted pressure flux (compressibility correction)
//
// Schemes are second-order, bounded and stable for transient buoyant flows.
//
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(p_rgh)     Gauss linear;
    grad(U)         Gauss linear;
    grad(h)         Gauss linear;
}

divSchemes
{
    default         none;

    // Momentum
    div(phi,U)              Gauss linearUpwind grad(U);

    // Energy — enthalpy (compressible fluid solver uses h as primary variable)
    div(phi,h)              Gauss linearUpwind grad(h);

    // Kinetic energy correction term in compressible energy equation
    div(phi,K)              Gauss linear;

    // Pressure-density coupling (compressibility): phi_density = rho * phi_vol
    div(phid,p)             Gauss limitedLinear 1;

    // Turbulence
    div(phi,k)              Gauss linearUpwind grad(k);
    div(phi,epsilon)        Gauss linearUpwind grad(epsilon);

    // Viscous stress (symmetric deviatoric part)
    div((nuEff*dev(T(grad(U)))))    Gauss linear;

    // Species — passive scalars (scalarTransport function objects)
    div(phi,CH4)            Gauss linearUpwind grad(CH4);
    div(phi,CO)             Gauss linearUpwind grad(CO);
    div(phi,H2)             Gauss linearUpwind grad(H2);
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p_rgh           ;   // pressure correction requires flux
    pcorr           ;   // non-orthogonality correction loop
}

// ************************************************************************* //
