openfoam/Allrun
#!/bin/bash
#
# Allrun — run the underground mine syngas dispersion simulation.
#
# Target: OpenFOAM Foundation v13 (foamRun + fluid solver)
#
# Usage:
#   ./Allrun          # Scenario 1 — Normal Ventilation     (2.0 m/s)
#   ./Allrun 2        # Scenario 2 — Moderate Syngas Leak   (1.5 m/s)
#   ./Allrun 3        # Scenario 3 — Ventilation Failure    (0.5 m/s)
#   ./Allrun 4        # Scenario 4 — Dead-Zone Accumulation (1.0 m/s)
#   ./Allrun 5        # Scenario 5 — Emergency Gas Release  (2.0 m/s)
#
# Requirements:
#   OpenFOAM Foundation v13  — source before running:
#     source /opt/openfoam13/etc/bashrc
#   Python 3 + numpy + pandas — for postProcess_extract.py
#
# Solver: foamRun -solver fluid  (compressible buoyant, v13)
#   heRhoThermo / perfectGas / hConst / realizableKE
#   rho = p / (R_specific * T),  R = 286.9 J/(kg.K)
#   At 293 K, 101325 Pa: rho = 1.205 kg/m3, nu = 1.50e-5 m2/s
#
# Species transport:
#   CH4/CO/H2 solved via scalarTransport functionObjects (solverFunctionObjects).
#   Source terms (continuous gas injection) are scenario-specific and read
#   from system/scalarSourceTerms (copied from scenarios/scenarioN/ below).
#
# Extended geometry: 80 m tunnel, Chamber 1 (x=[20,30] N), Chamber 2
#   (x=[50,62] N), South Stub (x=[35,43] S).  ~31,600 cells.
#
# Airflow validation (after any run):
#   postProcess -func yPlus_check    — check near-wall y+ distribution
#   postProcessing/inletFlowRate/    — volumetric flux for mass conservation
#   postProcessing/wallShearStress_check/ — friction validation

set -e
cd "$(dirname "$0")"

SCENARIO=${1:-1}

echo "========================================================"
echo " GreenMining Underground Mine CFD  —  OpenFOAM v13"
echo " Scenario ${SCENARIO}"
echo "========================================================"

# ---- 1. Validate scenario -----------------------------------------------
if [ ! -d "scenarios/scenario${SCENARIO}" ]; then
    echo "ERROR: scenarios/scenario${SCENARIO}/ not found"
    exit 1
fi

# ---- 2. Load scenario-specific initial conditions -----------------------
echo "[1/6] Loading scenario ${SCENARIO} initial conditions..."
cp scenarios/scenario${SCENARIO}/U             0/U
cp scenarios/scenario${SCENARIO}/setFieldsDict system/setFieldsDict

# Copy scenario-specific scalar source terms.
# These are read by the scalarTransport function objects in controlDict via:
#   fvOptions { #include "scalarSourceTerms" }
# For scenario 1 the file is empty (no active gas sources).
cp scenarios/scenario${SCENARIO}/scalarSourceTerms system/scalarSourceTerms

# ---- 3. Generate mesh ---------------------------------------------------
echo "[2/6] Running blockMesh..."
blockMesh > log.blockMesh 2>&1 || { echo "blockMesh FAILED:"; tail -10 log.blockMesh; exit 1; }

# ---- 4. Set initial gas-concentration fields ----------------------------
echo "[3/6] Running setFields..."
setFields > log.setFields 2>&1 || { echo "setFields FAILED:"; tail -10 log.setFields; exit 1; }

# ---- 5. Run CFD solver (OpenFOAM v13) -----------------------------------
echo "[4/6] Running foamRun (fluid solver, compressible buoyant + species transport)..."

if [ -f "system/decomposeParDict" ]; then
    NPROC=$(grep "numberOfSubdomains" system/decomposeParDict | grep -oP '\d+' | head -1)
    echo "      Parallel run on ${NPROC} processors"
    decomposePar -force > log.decomposePar 2>&1
    mpirun -np "${NPROC}" foamRun -solver fluid -parallel > log.solver 2>&1
    reconstructPar > log.reconstructPar 2>&1
else
    foamRun -solver fluid > log.solver 2>&1 || {
        echo "foamRun FAILED. Last 20 lines:"
        tail -20 log.solver
        exit 1
    }
fi

echo "      $(grep '^ExecutionTime' log.solver | tail -1)"

# ---- 6. Airflow validation (quick checks) --------------------------------
echo "[5/6] Airflow validation outputs..."

if [ -d "postProcessing/inletFlowRate" ]; then
    echo "      Flow rate logs: postProcessing/inletFlowRate/"
    echo "                      postProcessing/outletFlowRate/"
fi

if [ -d "postProcessing/yPlus_check" ]; then
    echo "      y+ field written to postProcessing/yPlus_check/"
fi

# ---- 7. Post-process to CSV for ML pipeline ----------------------------
echo "[6/6] Exporting CSV dataset..."
if command -v python3 &>/dev/null; then
    python3 postProcess_extract.py --scenario "${SCENARIO}" \
        && echo "      CSV: mine_cfd_output_scenario${SCENARIO}.csv" \
        || echo "      WARNING: postProcess_extract.py failed (check numpy/pandas)"
else
    echo "      python3 not found — skipping CSV export"
fi

echo ""
echo "Done."
echo "  Time dirs  : 0/ to 300/ (15 s intervals, 20 snapshots)"
echo "  Probes     : postProcessing/probes/  (12 points, fields: U p T CH4 CO H2)"
echo "  CSV data   : mine_cfd_output_scenario${SCENARIO}.csv"
echo "  y+ check   : postProcessing/yPlus_check/"
echo "  Flow rates : postProcessing/inletFlowRate/ and outletFlowRate/"
echo "  ParaView   : paraFoam -builtin"
echo ""
echo "  Species transport: CH4/CO/H2 actively transported by airflow."
echo "  Source terms     : scenarios/scenario${SCENARIO}/scalarSourceTerms"
